/*
. - любой символ
\ - экранирование символа
[] - перечисление
[a-d] - диапазон от а до d, включая крайние
[A-Za-z] - Два диапазона (большие и маленькие буквы)
{количество символов}
{0,5} - от 0 до 5 вхождений
{1,} - от 1 до бесконечности
() - группировка элементов
| - И

---

{0,1} - ?
{0,} - *
{1,} - +
[0-9] - \d (digit - цифры)
[^0-9] - всё КРОМЕ цифр - \D
[0-9A-Za-z_] - \w
[^0-9A-Za-z_] - всё, кроме \W
[ ] - \s (space)
[^ ] - \S - всё кроме пробелов, табуляций, перевода строки

Границы:
\b - border - граница слова
^ - начало строки
$ - конец строки


Флаги
/g - global, искать все вхождения
/i - insensitise, нечувствительность к регистру
/m - multiline - набор строк

*/